AdvancedSecurityServiceBinding.CreateSelfSignedCertificate.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tas="http://www.onvif.org/ver10/advancedsecurity/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tas:CreateSelfSignedCertificate>
    <tas:X509Version>1</tas:X509Version>
    <tas:Subject>
     <tas:Country></tas:Country>
     <tas:Organization></tas:Organization>
     <tas:OrganizationalUnit></tas:OrganizationalUnit>
     <tas:DistinguishedNameQualifier></tas:DistinguishedNameQualifier>
     <tas:StateOrProvinceName></tas:StateOrProvinceName>
     <tas:CommonName></tas:CommonName>
     <tas:SerialNumber></tas:SerialNumber>
     <tas:Locality></tas:Locality>
     <tas:Title></tas:Title>
     <tas:Surname></tas:Surname>
     <tas:GivenName></tas:GivenName>
     <tas:Initials></tas:Initials>
     <tas:Pseudonym></tas:Pseudonym>
     <tas:GenerationQualifier></tas:GenerationQualifier>
     <tas:GenericAttribute>
      <tas:Type></tas:Type>
      <tas:Value></tas:Value>
     </tas:GenericAttribute>
     <tas:MultiValuedRDN>
      <tas:Attribute>
       <tas:Type></tas:Type>
       <tas:Value></tas:Value>
      </tas:Attribute>
     </tas:MultiValuedRDN>
     <tas:anyAttribute>
      <tas:DomainComponent></tas:DomainComponent>
     </tas:anyAttribute>
    </tas:Subject>
    <tas:KeyID></tas:KeyID>
    <tas:Alias></tas:Alias>
    <tas:notValidBefore>2024-12-10T16:31:28Z</tas:notValidBefore>
    <tas:notValidAfter>2024-12-10T16:31:28Z</tas:notValidAfter>
    <tas:SignatureAlgorithm>
     <tas:algorithm></tas:algorithm>
     <tas:parameters></tas:parameters>
     <tas:anyParameters>
     </tas:anyParameters>
    </tas:SignatureAlgorithm>
    <tas:Extension>
     <tas:extnOID></tas:extnOID>
     <tas:critical>false</tas:critical>
     <tas:extnValue></tas:extnValue>
    </tas:Extension>
   </tas:CreateSelfSignedCertificate>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
